File 1 Variable                                                                         File 2 Variable                                                                    
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
       05 SHIRE-CODE2           PIC 9(5).                                        <>        05 SHIRE-CODE2           PIC 999.                                        
       05 SHIRE-ROAD            PIC S9(15) COMP.                                 <>        05 SHIRE-ROAD            PIC S9(15) COMP-3.                              
        10 SHIRE-NAME           PIC X(20).                                       <>         10 SHIRE-NAME           PIC XXXXXXXXXXXXXXXXXXXXXXXXXX.                 
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Total Unmatched Lines: 3
